#include<stdio.h>
int main()
{
	int a = 0, b = 0, c = 0, d = 0, e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)//每位选手都说对一半的意思是，每位选手所说的两个答案只有其中一个是对的，所以每位选手的答案都有两种可能性，并且每种可能性的和为1，因为错误时为0，即1+0=1
					{
						if ((2 == b && 3 != a) || (2 != b && 3 == a) == 1)
						{
							if ((2 == b && 4 != e) || (2 != b && 4 == e) == 1)
							{
								if ((1 == c && 2 != d) || (1 != c && 2 == d) == 1)
								{
									if ((5 == c && 3 != d) || (5 != c && 3 == d) == 1)
									{
										if ((4 == e && 1 != a) || (4 != e && 1 == a) == 1)
										{
											printf("a= %d, b= %d,c= %d,d= %d,e= %d\n", a, b, c, d, e);
										}
									}
								}
							}
						}
					}
				}
			}
		}
	}

	return 0;
}